{"data":{"markdownRemark":{"html":"<p>Wieso kann vermehrung.apflora.ch auf allen Geräten und Betriebssystemen gleichermassen verwendet werden?<br/><br/></p>\n<p>Weil es eine <strong>Progressive Web App</strong> ist.<br/><br/></p>\n<p><a href=\"https://developers.google.com/web/progressive-web-apps\" target=\"_self\" rel=\"nofollow\">Progressive Web Apps</a> sind Web-Applikationen und werden für Browser entwickelt.<br/>\nWeil sie aber einige zusätzliche Anforderungen erfüllen, können sie je länger je weniger von \"normalen\" Apps unterschieden werden. Google und Microsoft arbeiten daran, dieses Ziel zu erreichen.<br/><br/></p>\n<p>Was ist der Vorteil gegenüber einer \"normalen\" App?</p>\n<ul>\n<li>Die App funktioniert auf allen Bertriebssystemen und auf allen Geräten mit modernem Browser</li>\n<li>Sie finden die App im Internet (und auf Windows künftig im App-Store)</li>\n<li>Sie müssen die App nicht installieren. Das geschieht automatisch, wenn Sie die URL besuchen</li>\n<li>Updates erfolgen automatisch</li>\n<li>Einer neuen Mitarbeiterin schicken Sie einfach Link und Login und schon kann sie loslegen</li>\n</ul>\n<p>Je nach Betriebssystem und Browser werden Sie irgendwann gefragt, ob Sie vermehrung.apflora.ch auf dem Desktop ablegen möchten (oder Sie können es selber veranlassen).<br/>\nDanach öffnet sich vermehrung.apflora.ch ohne die URL-Zeile und andere Teile des Browsers. Und ist fortan auch optisch kaum mehr von einer \"normalen\" App unterscheidbar.<br/><br/></p>\n<p>Ist Ihnen aufgefallen, dass Apple oben nicht zusammen mit Google und Microsoft erwähnt wurde?<br/>\nApple verdient sein Geld mit dem App-Store. Würden Sie vermehrung.apflora.ch über den App-Store beziehen, gingen 30% dessen, was Sie uns zahlen, stattdessen an Apple.<br/>\nApple führt die für Progressive Web Apps nützlichen Technologien auffällig langsam ein. Es ist nicht in ihrem Interesse, wenn Progressive Web Apps nicht von anderen Apps unterschieden werden können.<br/>\nDaher funktionieren Progressive Web Apps auf Android und Windows besser als auf MacOS und iOS. Trotzdem funktionieren sie auch auf Apple-Geräten. Sie sind eben auch eine Web-App.</p>","frontmatter":{"date":"21.01.2019","path":"/Technische-Dokumentation/PWA","title":"Progressive Web App"}},"allMarkdownRemark":{"edges":[{"node":{"id":"1c04efcd-0120-5790-b982-da3601abc0a1","frontmatter":{"date":"21.01.2019","path":"/Technische-Dokumentation/PWA","title":"Progressive Web App"}}}]}},"pageContext":{}}